#coding:utf-8

import tushare as ts

'''
以上证50为例
指数的成交量等于指数中各成分股成交量之和
指数的成交额等于指数中各成分股成交额之和
'''

all = ts.get_today_all()#一次性获取当前交易所有股票的行情数据（如果是节假日，即为上一交易日，结果显示速度取决于网速）
sz50 = ts.get_sz50s()   #获取上证50成分股
index = ts.get_index()  #大盘指数行情列表

    #code        name    change   preclose      close       high        low  \
#0   000001    上证指数  -1.13   4527.396   4476.215   4572.391   4432.904
#1   000002    Ａ股指数  -1.13   4744.093   4690.628   4791.534   4645.190
#2   000003    Ｂ股指数  -2.15    403.694    395.018    405.795    392.173
#3   000008    综合指数   0.79   3724.496   3753.906   3848.575   3695.817
#4   000009   上证380  -2.79   7689.128   7474.305   7695.329   7398.911
#5   000010   上证180  -1.13  10741.180  10619.610  10863.080  10529.900
#6   000011    基金指数  -1.02   7033.291   6961.659   7058.856   6918.273
#7   000012    国债指数   0.01    148.626    148.641    148.656    148.510
#8   000016    上证50  -0.79   3308.454   3282.330   3370.025   3255.769
#9   000017     新综指  -1.13   3826.013   3782.936   3864.307   3746.284
#10  000300   沪深300  -1.37   4807.592   4741.861   4839.078   4703.567

sz50_vol = all[all.code.isin(sz50.code)].volume.sum()
sz50_amount = all[all.code.isin(sz50.code)].amount.sum()
idx50_vol = index[index.code == '000016'].volume.values[0]
idx50_amount = index[index.code == '000016'].amount.values[0]
print sz50_vol,idx50_vol
print sz50_amount,idx50_amount

'''
[Getting data:]#####################################1172763616 11727636
11066821847 110.6682
'''
